Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_FoundationLibraryRef/FoundationLibraryReference-level2.tmx
Source language: en_us
Languages: ja

source: Each capture group can then be used in a replacement template to insert that value into a replacement string.
ja: 各捕獲グループはそれから、その値を置き換え文字列に挿入するために置き換えテンプレートにおいて使われることができます。

source: Each cookie is represented by an instance of the HTTPCookie class.
ja: 各クッキーは、HTTPCookieクラスのインスタンスによって表されます。

source: Each index in an index path represents the index into an array of children from one node in the tree to another, deeper, node.
ja: 各インデックスはあるインデックスパスにおいて、子らからなる配列の中へのインデックスを、ツリーの中のあるノードから別の、より深いノードまで表します。

source: Each instance of an Dimension subclass has a converter, which is used to represent the unit in terms of the dimension’s base Unit().
ja: Dimensionサブクラスの各インスタンスはあるconverterを持ちます、それは、寸法の持つbase Unit()に基づいて単位を表すのに使用されます。

source: Each result gives the overall matched range via its range property, and the range of each individual capture group via its range(at:) method.
ja: それぞれの結果は、そのrangeプロパティ経由で全体的なマッチされた範囲を、そしてそのrange(at:)メソッドによって捕獲グループそれぞれの範囲を提供します。

source: Each task has a default distributed notification center that you access with the default() class method.
ja: 各タスクは、異なる分散通知センターを持ちます、それはあなたがdefault()クラスメソッドを使ってアクセスします。

source: Each thread has its own NSAssertion Handler object.
ja: 各スレッドはそれ自身のNSAssertion Handlerオブジェクトを持ちます。

source: Each time the NSImage object is drawn, it selects the representation best for the drawing context.
ja: NSImageオブジェクトが描画されるたびに、それは内容を描画するのに最良の表現を選択します。

source: Each time the comparison function is called, it’s passed context as its third argument.
ja: 比較関数が呼び出されるたびに、それはそれの３番目の引数としてcontextを渡されます。

source: Either an instance of NSLocale or a dictionary with a string value corresponding to the decimal Separator key.
ja: NSLocaleのインスタンスまたはdecimal Separatorキーに対応している文字列値を持つ辞書のいずれか。

source: Elements are added to the new array in the same order they appear in objects, up to but not including index count.
ja: 要素は、それらがobjectsにおいて現れるのと同じ順序で、インデックスcountまで、しかしそれを含めずに、新しい配列に加えられます。

source: Elements are sorted in ascending order.
ja: 要素は昇順にソートされます。

source: Elements that are used to split the collection are not returned as part of any subsequence.
ja: コレクションを分割するのに使われる要素らは、どれかの下位シーケンスの一部として返されません。

source: Elements that are used to split the sequence are not returned as part of any subsequence.
ja: シーケンスを分割するのに使われる要素らは、どれかの下位シーケンスの一部として返されません。

source: Encode and Decode Automatically
ja: 自動的にエンコードおよびデコードする

source: Encode and Decode Manually
ja: 手動でエンコードおよびデコードする

source: Encode or Decode Exclusively
ja: 排他的にエンコードおよびデコードする

source: Encodes this calendar into the given encoder.
ja: 与えられたエンコーダへとこのカレンダーをエンコードします。

source: Encodes this decimal value into the given encoder.
ja: この10進値を与えられたエンコーダにエンコードします。

source: Encoding Dates
ja: 日付をエンコードする

source: Encoding Exceptional Numbers
ja: 普通でない数をエンコードする

source: Encoding Raw Data
ja: 生のデータをエンコードする

source: Encoding and Decoding
ja: エンコーディングとデコーディング

source: Encoding and Decoding Custom Types
ja: あつらえの型のエンコーディングとデコーディング

source: Encoding options.
ja: エンコーディングオプション。

source: Encoding, Decoding, and Serialization
ja: エンコード、デコード、そしてシリアライズ

source: Enumerates the contents of the data's buffer.
ja: データの持つバッファの内容を列挙します。

source: Enumerates the string allowing the Block to handle each regular expression match.
ja: 文字列を、「ブロック」に各正規表現マッチを取り扱わせて、列挙します。

source: Enumerates the substrings of the specified type in the specified range of the string.
ja: 指定された範囲の文字列の中の指定された型の下位文字列を列挙します。

source: Enumeration Case
ja: 列挙ケース

source: Enumeration Cases
ja: 列挙ケース

source: Enumerations
ja: 列挙

source: Epoch Formats
ja: 紀元書式設定

source: Equal to k CFDate Formatter Full Style.
ja: k CFDate Formatter Full Styleに等しい。

source: Equal to k CFDate Formatter Long Style.
ja: k CFDate Formatter Long Styleに等しい。

source: Equal to k CFDate Formatter Medium Style.
ja: k CFDate Formatter Medium Styleに等しい。

source: Equal to k CFDate Formatter No Style.
ja: k CFDate Formatter No Styleに等しい。

source: Equal to k CFDate Formatter Short Style.
ja: k CFDate Formatter Short Styleと等しい。

source: Equivalent behaviors can be specified for the entire pattern when an NSRegular Expression is initialized, using the NSRegular Expression .Options option flags.
ja: 同等の挙動は、パターン全体に対してNSRegular Expressionが初期化される時に、NSRegular Expression .Optionsオプション・フラグを使って指定されることができます。

source: Equivalent to specifying with Year, with Month, and with Day
ja: with Year、with Month、そしてwith Dayを指定することに等しい

source: Equivalent to specifying with Full Date, with Full Time, with Dash Separator In Date, with Colon Separator In Time, and with Colon Separator In Time Zone.
ja: with Full Date, with Full Time, with Dash Separator In Date, with Colon Separator In Time, そして with Colon Separator In Time Zoneを指定することに等しい。

source: Error Codes
ja: さまざまなエラーコード

source: Error Handling
ja: エラー処理

source: Error codes to expect when an iCloud-related error occurs.
ja: iCloud関連のエラーが起こる場合に予想するエラーコード。

source: Errors
ja: エラー

source: Errors and Exceptions
ja: エラーと例外

source: Escaping Characters in a String
ja: 文字列中の文字をエスケープする

source: Evaluate the parenthesized expression with the specified flags enabled or -disabled.
ja: 指定されたフラグを有効にあるいは無効にして、括弧に入れられた表現を評価します。

source: Evaluates a given predicate against each object in the receiving array and returns a new array containing the objects for which the predicate returns true.
ja: 与えられた述部を受け手側の配列の中の各オブジェクトに対して評価して、その述部に対してtrueを返すオブジェクトを含んでいる新しい配列を返します。

source: Event-Based Processing
ja: イベント基盤の処理

source: Exactly eight hex digits must be provided, even though the largest Unicode code point is \U0010ffff.
ja: たとえ最も大きいUnicodeコード点が\U0010ffffであるとしても、正確に８つの16進桁が提供されなければなりません。

source: Example
ja: 例

source: Examples Using NSRegularExpression
ja: NSRegularExpressionの使用例

source: Except for some trivial cases (e.g., ‘seconds’ should be 0 - 59 in any calendar), this method is not necessarily cheap.
ja: 幾つかの些細な場合を除きます（例えば、‘seconds’ はあらゆるカレンダーにおいて0-59のはずです）、このメソッドは必ずしも安価ではありません。

source: Exception Names
ja: 例外名

source: Exceptional Values
ja: 例外値

source: Exceptional values are defined by the IEEE 754 floating-point specification and include infinity and nan.
ja: 例外値は、IEEE 754浮動小数点仕様によって定義されます、そしてinfinityとnanを含みます。

source: Exceptions
ja: 例外

source: Exceptions raised by key-value coding methods.
ja: キー値コーディングメソッドによって引き起こされる例外。

source: Exchanges the values at the specified indices of the collection.
ja: そのコレクションの指定インデックスでの値を交換します。

source: Excluding Bytes
ja: バイトを排除する

source: Excluding Elements
ja: 要素を排除する

source: Excluding Indexes
ja: インデックスを排除する

source: Excluding Nodes
ja: ノードを除く

source: Exclusive or the Index Set with other.
ja: Index Setのotherとの排他的論理和。

source: Executable cannot be loaded for some other reason, such as a problem with a library it depends on.
ja: 実行可能ファイルは、何らかの他の理由のためロードされることができません、例えばそれが依存するライブラリのもつ問題など。

source: Executable does not provide an architecture compatible with the current process.
ja: 実行可能ファイルは、現在のプロセスと互換性のあるアーキテクチャを提供しません。

source: Executable fails due to linking issues.
ja: 実行可能ファイルは、リンク問題のため失敗します。

source: Executable has Objective C runtime information incompatible with the current process.
ja: 実行可能ファイルは、現在のプロセスと互換性のないObjective Cランタイム情報を持ちます。

source: Executable is of a type that is not loadable in the current process.
ja: 実行可能ファイルは、現在のプロセスにおいてロード可能でない型のものです

source: Execute the AppleScript script by sending it the specified Apple event.
ja: AppleScriptスクリプトを、それを指定されたアップルイベントに送ることによって実行します。

source: Executes a given block using the objects in the array at the specified indexes.
ja: 与えられたブロックを、指定されたインデックスでの、配列の中のオブジェクトを使って実行します。

source: Executes an Apple event in the context of the receiver, as a means of allowing the application to invoke a handler in the script.
ja: レシーバのコンテキストにおいてアップルイベントを実行します、アプリケーションにスクリプト中のハンドラを発動することを許可する手段として。

source: Executes the receiver, compiling it first if it is not already compiled.
ja: レシーバを実行します、それがまだコンパイルされていないならばまず最初にコンパイルします。

source: Executes the script with no input and ignoring any result.
ja: 入出力を伴わなずあらゆる結果を無視してスクリプトを実行します。

source: Executing a command means either invoking the selector associated with the command on the object or objects designated to receive the command, or having the command perform its default implementation method (perform Default Implementation()).
ja: コマンドの執行は、そのコマンドと結びつけられるセレクタをそのコマンドを受け取るよう指名されたオブジェクトまたは複数オブジェクト上で発動する、またはコマンドにそれの省略時の実装メソッド（perform Default Implementation()）を実行させるかのどちらかを意味します。

source: Executing an AppleScript Script
ja: AppleScriptスクリプトの実行

source: Executing the User Script
ja: ユーザスクリプトの実行

source: Explicitly deleting the item by calling the remove Item(at:) or remove Item(at Path:) method also deletes all old versions of the item, invalidating URLs to those versions returned by this method.
ja: remove Item(at:)またはremove Item(at Path:)メソッドを呼び出すことによって明示的に項目を削除することはまた、項目のすべての古いバージョンを削除して、このメソッドによって返されるそれらのバージョンのURLを無効にします。

source: Exponent
ja: 指数

source: Extending Existing NSDimension Subclasses
ja: 既存のNSDimensionサブクラスを拡張する

source: Extension Support
ja: 拡張サポート

source: Extracting Components
ja: 構成要素の抽出

source: Failure to get a lock on file.
ja: ファイルに鍵をかけるのに失敗する。

source: Fast enumeration is available in macOS 10.5 and later and iOS 2.0 and later.
ja: 高速列挙は、macOS 10.5以降とiOS 2.0以降で利用可能です。

source: Fetching Context Help Resources
ja: コンテキストヘルプ・リソースを取ってくる

source: Fetching Localized Strings
ja: ローカライズされた文字列を取ってくる

source: File Path Functions
ja: ファイルパス関数

source: File Search
ja: ファイル検索

source: File System
ja: ファイルシステム

source: File System Error Codes
ja: ファイルシステムエラーコード

source: File System Operations
ja: ファイルシステム演算

source: File wrapper for node.
ja: nodeに対するファイルラッパー。

source: File wrapper for the file-system node at url.
ja: urlでのファイルシステムノードに対するファイルラッパー。

source: File wrapper to add to the directory.
ja: ディレクトリに加えることになるファイルラッパー。

source: File wrapper to remove from the directory.
ja: ディレクトリから除去することになるファイルラッパー。

source: File wrappers represent a file system node as an object that can be displayed as an image (and possibly edited in place), saved to the file system, or transmitted to another application.
ja: ファイルラッパーは、ファイルシステムノードを、画像として表示（そしておそらくは場に合わせて手直し）されること、ファイルシステムに保存されること、または別のアプリケーションに伝えられることが可能なオブジェクトとして表します。

source: File-system operation attempted on non-existent file.
ja: 存在しないファイルに試みられるファイルシステム演算。

source: File-wrapper type
ja: ファイルラッパー型

source: Files and Data Persistence
ja: ファイルとデータ永続

source: Files and directories tagged for cloud storage are synced to iCloud so that they can be made available to the user’s iOS devices and Macintosh computers.
ja: クラウドストレージに対するタグをつけられるファイルとディレクトリは、iCloudと同期します、それでそれらはユーザの持つiOSデバイスとMacintoshコンピュータに利用可能にされます。

source: Files can be created while the device is locked, but once closed, cannot be opened again until the device is unlocked.
ja: ファイルは、デバイスがロックされている間に作成できます、しかし一旦閉じたならば、デバイスがアンロックされるまで再び開かれることはできません。

source: Filtering
ja: フイルタする

source: Filters and Sorting
ja: フィルタとソート

source: Finally, initialize and start an URLSession Task, NSURLConnection, or NSURLDownload object based on that request object.
ja: 最後に、URLSession Task、NSURLConnection、またはNSURLDownloadオブジェクトをそのリクエストオブジェクトに基づいて、初期化して開始してください

source: Find the range of the weekend around the given date, returned via two by-reference parameters.
ja: 与えられた日付の辺りの週末の範囲を見つけます、２つの参照渡しパラメータ経由で返されます。

source: Finding Bytes
ja: バイトを捜す

source: Finding Elements
ja: 要素を見つける

source: Finding Image Resources
ja: 画像リソースを見つける

source: Finding Indexes
ja: インデックスを見つける

source: Finding Nodes
ja: ノードを見つけ出す

source: Finding Objects in an Array
ja: 配列内のオブジェクトを見つける

source: Finding Resource Files
ja: リソースファイルを見つける

source: Finding Sound Resources
ja: サウンドリソースを見つける

source: Finding and Opening a Bundle
ja: バンドルを捜して開く

source: Finds the range of the specified data as a subsequence of this data, if it exists.
ja: このデータの下位シーケンスとして指定された範囲のデータを捜します、それが存在するならば。

source: First Steps
ja: 初歩

source: First match of the parenthesized subexpression is the only one tried; if it does not lead to an overall pattern match, back up the search for a match to a position before the "(?>"
ja: 括弧に入れられた正規表現部分の１回目のマッチが、試みられる唯一のものです；それが全体としてパターンマッチに至らないならば、「(?>」の前の位置に検索を戻します

source: First test the passed-in object to see if it’s of the correct class.
ja: まず渡されたオブジェクトをそれが正しいクラスのものか見るためにテストしてください。

source: Flag (Pattern)
ja: フラグ（パターン）

source: Flag Options
ja: フラグ・オプション

source: Flag settings.
ja: フラグ設定。

source: For a complete list of unit styles, see Formatter .Unit Style.
ja: 完全な単位スタイルの一覧として、Formatter .Unit Styleを見てください。

source: For a comprehensive treatment of object specifiers, including sample code, see Object Specifiers in Cocoa Scripting Guide.
ja: サンプルコードを含む、オブジェクト指定子の網羅的な取り扱いとして、オブジェクト指定子をCocoaスクリプティングガイドで見てください。

source: For a directory file wrapper, the contained file wrappers are also sent update(from Path:) messages.
ja: ディレクトリファイルラッパーに対して、含まれるファイルラッパーもまた、update(from Path:)メッセージを送ります。

source: For a directory or file to be deletable, the current process must either be able to write to the parent directory of path or it must have the same owner as the item at path.
ja: 削除されることになるファイルやディレクトリに対して、現在のプロセスはpathの親ディレクトリに対して書き込み可能である、または、それはpathでの項目と同じ所有者を持たなければならない、どちらかでなければなりません。

source: For a directory, children are compared against the files in the directory, recursively.
ja: あるディレクトリに対して、子らがそのディレクトリの中のファイルに対して比較されます、再帰的に。

source: For a full list of error types, see Foundation Errors .h.
ja: エラータイプの完全なリストとして、Foundation Errors .hを見てください。

source: For a given URL, you can determine if a file is downloaded by getting the value of the NSMetadata Ubiquitous Item Downloading Status Key key.
ja: 与えられたURLに対して、あなたはダウンロードされたかをNSMetadata Ubiquitous Item Downloading Status Keyキーの値を取得することによって判定できます。

source: For a given key that defines the name of the relationship from the receiver’s class to another class, returns the name of the relationship from the other class to the receiver’s class.
ja: レシーバのクラスから別のクラスへのリレーションシップ（関係）の名前を定義する指定されたキーに対して、別のクラスからレシーバのクラスへのリレーションシップの名前を返します。

source: For a list of available keys for this dictionary, see UIKit Nib Loading Options.
ja: この辞書のために利用可能なキーのリストとして、UIKit Nib Loading Optionsを見てください。

source: For a list of keys you can include in this dictionary, Constants.
ja: あなたがこの辞書に含めることができるキーの一覧としては、定数。

source: For a list of keys you can include in this dictionary, see Constants.
ja: あなたがこの辞書において含めることができるキーの一覧として、定数を見てください。

source: For a list of keys you can specify, see Common File System Resource Keys.
ja: あなたが指定できるキーの一覧として、Common File System Resource Keysを見てください。

source: For a list of keys, see File Attribute Key.
ja: キーの一覧として、File Attribute Keyを見てください。

source: For a list of possible values, see File Manager .Search Path Directory.
ja: 可能な値の一覧として、File Manager .Search Path Directoryを見てください。

source: For a list of possible values, see File Manager .Volume Enumeration Options.
ja: 可能な値の一覧として、File Manager .Volume Enumeration Optionsを見てください。

source: For a list of possible values, see File Manager .URLRelationship.
ja: 可能な値の一覧として、File Manager .URLRelationshipを見てください。

source: For a list of possible values, see File Protection Values.
ja: 可能な値の一覧として、File Protection Valuesを見てください。

source: For a positive delta, shifts the indexes in [index, INT_MAX] to the right, thereby inserting an “empty space” [index, delta], for a negative delta, shifts the indexes in [index, INT_MAX] to the left, thereby deleting the indexes in the range [index - delta, delta].
ja: 正の delta に対して、ある “空白” を [index, delta] に挿入することによって、[index, INT_MAX] の中のインデックスを右にずらします、負の delta に対して、範囲 [index - delta, delta] の中のインデックスを消去することによって、[index, INT_MAX] の中のインデックスを左にずらします。

source: For a rectangle of positive height located in positive x and y coordinates:
ja: 正の x と y 座標に位置する、正の高さをもつ矩形に対して：

source: For a running app, the main bundle offers access to the app’s bundle directory.
ja: 実行中のアプリに対して、メインバンドルはアプリの持つバンドルディレクトリへのアクセスを提供します。

source: For a sandboxed app in macOS, the group directory is located at ~/Library/Group Containers/<application-group-id>, where the application group identifier begins with the developer's team identifier followed by a dot, followed by the specific group name.
ja: macOSでのサンドボックスアプリでは、グループディレクトリは~/Library/Group Containers/<application-group-id>に位置します、そこにおいてアプリケーショングループ識別子は開発者の持つチーム識別子に１つのドットが続くことで始まり、特定のグループ名が続きます。

source: For all other unit styles, this behavior drops all units whose values are 0.
ja: 全ての他の単位スタイルに対して、この挙動は、値が０である全ての単位を落とします。

source: For an application purchased from the App Store, use this application bundle property to locate the receipt.
ja: App Storeから購入されるアプリケーションに対して、このアプリケーションバンドルプロパティを使ってレシートを捜し出してください。

source: For an example implementation, see "Implementing Object Specifiers" in Object Specifiers in Cocoa Scripting Guide
ja: 実装の例として、「オブジェクト指定しの実装」をオブジェクト指定子においてCocoaスクリプティングガイドで見てください。

source: For any values a and b, a != b implies that a == b is false.
ja: 何らかのaとbに対して、a != bはa == bがfalseであることを意味します。

source: For applications linked on or after OS X v10.6, this method instead returns an error if part of the string cannot be parsed.
ja: OS X 10.6にまたは以降と組み合わされたアプリケーションに対して、このメソッドは代わりにエラーを、文字列の一部が構文解析できなかったならば返します。

source: For basic NSRegular Expression objects, these match results will be of type regular Expression, but subclasses may use other types.
ja: 基本的なNSRegular Expressionオブジェクトのために、これらのマッチ結果は型regular Expressionです、しかしサブクラスは他の型を使うかもしれません。

source: For better word boundaries, see use Unicode Word Boundaries.
ja: より良い語境界としては、use Unicode Word Boundariesを見てください。

source: For clients implementing their own replace functionality, this is a method to perform the template substitution for a single result, given the string from which the result was matched, an offset to be added to the location of the result in the string (for example, in cases that modifications to the string moved the result since it was matched), and a replacement template.
ja: クライアントの実装する独自の置換機能のために、これは、そこにおいて結果がマッチされた文字列、文字列中の結果の場所に加えられるオフセット（例えば、それがマッチされてからその結果が移動された文字列に対する変更の場合に備えて）、そして置換用テンプレートを与えて、ある単一の結果にテンプレート置換を実行するためのメソッドです。

source: For code running in a framework, the main bundle offers access to the framework’s bundle directory.
ja: 実行中のフレームワークに対して、メインバンドルはフレームワークの持つバンドルディレクトリへのアクセスを提供します。

source: For collections that don’t conform to Random Access Collection, accessing the count property iterates through the elements of the collection.
ja: Random Access Collectionに準拠しないコレクションに対して、countプロパティにアクセスすることはコレクションの要素を始めから終わりまで反復します。

source: For communication between tasks on different computers, use Distributed Objects Programming Topics.
ja: 異なるコンピュータ上のタスク間通信については、Distributed Objects Programming Topicsを使ってください。

source: For components which are not specified in each Date Components, but required to specify an absolute date, the base value of the component is assumed.
ja: 各Date Componentsにおいて指定されない、しかし絶対日付を指定するのに必要分ある構成要素に対して、その構成要素の基本値が仮定されます。

source: For dates, this style displays the day, month, and year in numerical form using a format appropriate for the current locale.
ja: 日付に対して、このスタイルは、日にち、月、そして年を数字形式で、現在のロケールに適切な書式設定を使って表示します。

source: For dates, this style displays the numerical day and year and a spelled out version of the month and day of week using a format appropriate for the current locale.
ja: 日付に対して、このスタイルは、数字の日にちと年そして完全綴り版の月と曜日を、現在のロケールに適切な書式設定を使って表示します。

source: For dates, this style displays the numerical day and year and a spelled out version of the month using a format appropriate for the current locale.
ja: 日付に対して、このスタイルは、数字の日にちと年そして完全綴り版の月を、現在のロケールに適切な書式設定を使って表示します。

source: For dates, this style displays the numerical day and year and an abbreviated spelling of the month using a format appropriate for the current locale.
ja: 日付に対して、このスタイルは、数字の日にちと年そして省略綴り版の月を、現在のロケールに適切な書式設定を使って表示します。

source: For descriptions of all these error conditions, see exception During Operation(_: error: left Operand: right Operand:) in NSDecimalNumberBehaviors.
ja: これらのエラー条件のすべての説明として、exception During Operation(_: error: left Operand: right Operand:)をNSDecimalNumberBehaviorsで見てください。

source: For details on how localized resources are found, read The Bundle Search Pattern in Bundle Programming Guide.
ja: どのようにローカライズされたリソースが見つけられるかに関する詳細は、The Bundle Search PatternをBundle Programming Guideで読んでください。

source: For each Date Components, if its time Zone property is set, that time zone is used for it.
ja: 各Date Componentsに対して、それのtime Zoneプロパティが設定されるならば、そのタイムゾーンがそれに対して使われます。

source: For each integer in the range that intersects the integers in the IndexSet, then the include Integer predicate will be invoked.
ja: IndexSetの中の整数との交差であるこの範囲の中の各整数に対して、その上include Integer述部が発動されます。

source: For each returned URL, the specified properties are fetched and cached in the NSURL object.
ja: 返されるURLそれぞれに対して、指定されたプロパティは取ってこられてNSURLオブジェクトにキャッシュされます。

source: For each returned URL, the values for these keys are cached in the corresponding NSURL objects.
ja: 返されるURL各々に対して、これらキーの値は対応するNSURLオブジェクトの中にキャッシュされます。

source: For example, (?i) changes to a case insensitive match.The flags are defined in Flag Options.
ja: 例えば、(?i)は、大文字小文字を区別しないマッチへ変更します。フラグは、「フラグ・オプション」で定義されます

source: For example, 12 hours and 33 minutes in the afternoon using a 12-hour clock results in the value “12:33 PM” for US English format and “12:33 nachm.” for German.
ja: 例えば、12時間時計を使う午後における12時間と33分は、米国語書式設定に対して値 “12:33 PM” そして独語に対して “12:33 nachm.” という結果になります。

source: For example, 12 hours, 33 minutes, and 29 seconds in the afternoon using a 12-hour clock and the Pacific Time Zone results in the value “12:33:29 PM PST” for US English without daylight savings in effect and “12:33:29 GMT-8” for German.
ja: 例えば、12時間時計と太平洋タイムゾーンを使う午後における12時間、33分、そして29秒は、米国語に対してサマータイム実施なしで値 “12:33:29 PM PST” そして独語に対して “12:33:29 GMT-8” という結果になります。

source: For example, 12 hours, 33 minutes, and 29 seconds in the afternoon using a 12-hour clock and the Pacific Time Zone results in the value “12:33:29 PM Pacific Standard Time” for US English without daylight savings in effect and “12:33:29 Nordamerikanische Westküsten-Normalzeit” for German.
ja: 例えば、12時間時計と太平洋タイムゾーンを使う午後における12時間、33分、そして29秒は、米国語に対してサマータイム実施なしで値 “12:33:29 PM Pacific Standard Time” そして独語に対して “12:33:29 Nordamerikanische Westküsten-Normalzeit” という結果になります。

source: For example, 12 hours, 33 minutes, and 29 seconds in the afternoon using a 12-hour clock results in the value “12:33:29 PM” for US English 12-hour format and “12:33:29 nachm.” for German.
ja: 例えば、12時間時計を使う午後における12時間、33分、そして29秒は、米国語12時間書式設定に対して値 “12:33:29 PM” そして独語に対して “12:33:29 nachm.” という結果になります。

source: For example, 2 is the weekday ordinal unit for the second Friday of the month.
ja: 例えば、２は月の第２金曜日に対する曜日序数単位です。

source: For example, "127 .0 .0 .1" or "fe80:: 1".
ja: 例えば、"127 .0 .0 .1"または"fe80:: 1"。

source: For example, "192 .42 .172 .1" or "fe80:: 1".
ja: 例えば、"192 .42 .172 .1"または"fe80:: 1"。

source: For example, NSString does not implement most of the methods declared in this informal protocol, but NSString objects still handle messages conforming to this protocol properly because NSString implements a compare: method that meets the necessary requirements.
ja: 例えば、NSStringはこの非形式プロトコルにおいて宣言されるメソッドのほとんどを実装しません、しかしNSStringオブジェクトはこのプロトコルに準拠するメッセージを依然として正しく取り扱います、なぜならNSStringは必要な要件を満たすcompare:メソッドを実装するからです。

source: For example, a sorted array {A, B, D, E, F} with corresponding hash values {25, 96, 78, 32, 17}, may be subject to small changes that result in contents {E, A, C, B, F}.
ja: 例えば、対応するハッシュ値 {25, 96, 78, 32, 17} を持つソートされた配列 {A, B, D, E, F} は、内容 {E, A, C, B, F} という結果になる小さな変更にさらされるかもしれません。

source: For example, a user browsing an article in Safari on a Mac can move to an iOS device where the same webpage automatically opens in Safari with the same scroll position.
ja: 例えば、Mac上のSafariである記事を閲覧しているユーザは、同じウェブページを自動的にSafariで同じスクロール位置で開くiOSデバイスへと移動できます。
